
	
Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Настройки = КомпоновщикНастроек.Настройки;
	
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, Настройки);
	
	ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновки.Инициализировать(МакетКомпоновки);
	
	
	
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПроцессорВывода.УстановитьДокумент(ДокументРезультат);
	
	ПроцессорВывода.НачатьВывод();
	
	ВыведенаШапка = Ложь;
	
	ЭлементРезультата = ПроцессорКомпоновки.Следующий();
	Пока Не ЭлементРезультата = Неопределено Цикл
		
		Если Не ВыведенаШапка И ЭлементРезультата.ЗначенияПараметров.Количество()>0 Тогда
			ВыведенаШапка = Истина;
			ДокументРезультат.ФиксацияСверху = ДокументРезультат.ВысотаТаблицы;
		КонецЕсли;
			ПроцессорВывода.ВывестиЭлемент(ЭлементРезультата);
			ЭлементРезультата = ПроцессорКомпоновки.Следующий();
	КонецЦикла;
		
	ПроцессорВывода.ЗакончитьВывод();
	
КонецПроцедуры


