Процедура РассчитатьЗаписи(Регистратор) Экспорт
	
	//TODO: Модуль для расчета зарплаты
	
	НаборЗаписей = РегистрыРасчета.ЖурналНачислений.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Регистратор.Установить(Регистратор);
	НаборЗаписей.Прочитать();
	
	Отбор = Новый Структура( );
	Отбор.Вставить("Регистратор", Регистратор);
	
	ТЗ_ФактДней = РегистрыРасчета.ЖурналНачислений.ПолучитьДанныеГрафика(Отбор, ВидПериодаРегистраРасчета.ФактическийПериодДействия)
	ТЗ_НормаДней = РегистрыРасчета.ЖурналНачислений.ПолучитьДанныеГрафика(Отбор, ВидПериодаРегистраРасчета.ПериодДействия);
	
	МассивРесурсов = Новый Массив(2);
	МассивРесурсов[0] = "ЖурналНачислений.Сумма";
	МассивРесурсов[1] = "ЖурналНачислений.ОтработаноДней";
		
	СтруктураИзмерений = Новый Структура();
	СтруктураИзмерений.Вставить("Сотрудник", "ЖурналНачислений.Сотрудник");
		
	ТЗ_База = РегистрыРасчета.ЖурналНачислений.ПолучитьБазу(МассивРесурсов, СтруктураИзмерений);
	
	
	
	Для Каждого Из НаборЗаписей Цикл
		
		Индекс = НаборЗаписей.Индекс(Записать);
		База = ТЗ_База[Индекс].Сумма;
		ФактДней = ТЗ_ФактДней[Индекс].Признак;
		НормаДней = ТЗ_НормаДней[Индекс].Признак;
		ДнейВБазе = ТЗ_База[Индекс].ОтработаноДней;
		
		Если Запись.ВидРасчета = ПланыВидовРасчета.Начисления.ОкладСуммой Тогда
			Запись.Сумма = Запись.Параметр;
		ИначеЕсли Запись.ВидРасчета = ПланыВидовРасчета.Начисления.ПремияПроцентом Тогда
			Запись.Сумма = База * Запись.Параметр / 100;
		ИначеЕсли Запись.ВидРасчета = ПланыВидовРасчета.Начисления.ОкладПоДням Тогда
			Запись.Сумма = ФактДней * Запись.Параметр;
		ИначеЕсли Запись.ВидРасчета = ПланыВидовРасчета.Начисления.ОкладЗаМесяц Тогда
			
			Если НормаДней = 0 Тогда
				Запись.Сумма = 0;
			Иначе 
				Запись.Сумма = ФактДней / НормаДней * Запись.Параметр;
			КонецЕсли;

		ИначеЕсли Запись.ВидРасчета = ПланыВидовРасчета.Начисления.Больничный Тогда
			Запись.Сумма = ФактДней / ДнейВБазе * База * Запись.Параметр / 100;
		КонецЕсли;
		
		Если Запись.ВидРасчета.УчитыватьОтработанныеДни Тогда 
			Запись.ОтработаноДней = ФактДней;
		КонецЕсли;
		
		Если Запись.Сторно Тогда
			Запись.Сумма = -Запись.Сумма;
			Запись.ОтработаноДней = -Запись.ОтработаноДней;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура РассчитатьЗаписиЗапросом(Регистратор, ПериодРегистрацции) Экспорт
	
	//TODO: Модуль для расчета зарплаты запросом
	
	НаборЗаписей = РегистрыРасчета.ЖурналНачислений.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Регистратор.Установить(Регистратор);
	НаборЗаписей.Прочитать();
	
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ЖурналНачисленийДанныеГрафика.НомерСтроки,
		|	ЖурналНачисленийДанныеГрафика.Сторно,
		|	ЖурналНачисленийДанныеГрафика.Параметр
		|ИЗ
		|	РегистрРасчета.ЖурналНачислений.ДанныеГрафика(Регистратор = &Регистратор
		|	И ПериодРегистрации = &ПериодРегистрации) КАК ЖурналНачисленийДанныеГрафика";
	
	Запрос.УстановитьПараметр("ПериодРегистрации", ПериодРегистрации);
	Запрос.УстановитьПараметр("Регистратор", Регистратор);
	
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ОбластьДетальныхЗаписей.Параметры.Заполнить(ВыборкаДетальныеЗаписи);
		ТабДок.Вывести(ОбластьДетальныхЗаписей, ВыборкаДетальныеЗаписи.Уровень());
	КонецЦикла;
		
	Для Каждого Из НаборЗаписей Цикл
		
		База = ТЗ_База[Индекс].Сумма;
		ФактДней = ТЗ_ФактДней[Индекс].Признак;
		НормаДней = ТЗ_НормаДней[Индекс].Признак;
		ДнейВБазе = ТЗ_База[Индекс].ОтработаноДней;
		
		Если Запись.ВидРасчета = ПланыВидовРасчета.Начисления.ОкладСуммой Тогда
			Запись.Сумма = Запись.Параметр;
		ИначеЕсли Запись.ВидРасчета = ПланыВидовРасчета.Начисления.ПремияПроцентом Тогда
			Запись.Сумма = База * Запись.Параметр / 100;
		ИначеЕсли Запись.ВидРасчета = ПланыВидовРасчета.Начисления.ОкладПоДням Тогда
			Запись.Сумма = ФактДней * Запись.Параметр;
		ИначеЕсли Запись.ВидРасчета = ПланыВидовРасчета.Начисления.ОкладЗаМесяц Тогда
			
			Если НормаДней = 0 Тогда
				Запись.Сумма = 0;
			Иначе 
				Запись.Сумма = ФактДней / НормаДней * Запись.Параметр;
			КонецЕсли;

		ИначеЕсли Запись.ВидРасчета = ПланыВидовРасчета.Начисления.Больничный Тогда
			Запись.Сумма = ФактДней / ДнейВБазе * База * Запись.Параметр / 100;
		КонецЕсли;
		
		Если Запись.ВидРасчета.УчитыватьОтработанныеДни Тогда 
			Запись.ОтработаноДней = ФактДней;
		КонецЕсли;
		
		Если Запись.Сторно Тогда
			Запись.Сумма = -Запись.Сумма;
			Запись.ОтработаноДней = -Запись.ОтработаноДней;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры