
&НаКлиенте
Процедура ОтчествоПриИзменении(Элемент)
	ОбновитьФИО();
	Если ПустаяСтрока(Объект.Отчество) Тогда
		Возврат;
	КонецЕсли;
	
	ОкончаниеОтчества = Нрег(Прав(Объект.Отчество,2));
	
	Если ОкончаниеОтчества = "на" Тогда
		Объект.Пол = ПредопределенноеЗначение("Перечисление.ПолМЖ.Ж");
	ИначеЕсли ОкончаниеОтчества = "ич" Тогда
		Объект.Пол = ПредопределенноеЗначение("Перечисление.ПолМЖ.М"); 	
	Иначе Объект.Пол = ПредопределенноеЗначение("Перечисление.ПолМЖ.ПустаяСсылка"); 	 	
	КонецЕсли;	
КонецПроцедуры

Процедура   ОбновитьФИО ()
	Объект.Наименование = Объект.Фамилия + " " + Лев(Объект.Имя,1) + ". " + Лев(Объект.Отчество,1) + ".";
	
КонецПроцедуры

&НаКлиенте
Процедура ИмяПриИзменении(Элемент)
	ОбновитьФИО();
КонецПроцедуры

&НаКлиенте
Процедура ФамилияПриИзменении(Элемент)
	ОбновитьФИО();
КонецПроцедуры
