
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	//{{_КОНСТРУКТОР_ПЕЧАТИ(ПечатьКонструктор)
	ТабДок = Новый ТабличныйДокумент;
	ПечатьКонструктор(ТабДок, ПараметрКоманды);

	ТабДок.ОтображатьСетку = Ложь;
	ТабДок.Защита = Истина;
	ТабДок.ТолькоПросмотр = Истина;
	ТабДок.ОтображатьЗаголовки = Ложь;
	ТабДок.Показать();
	//}}
КонецПроцедуры

&НаСервере
Процедура ПечатьКонструктор(ТабДок, ПараметрКоманды)
	Документы.СчетНаОплату.ПечатьКонструктор(ТабДок, ПараметрКоманды);
КонецПроцедуры
