
&НаКлиенте
Процедура Печать1(Команда)
	ТабДокс = Новый ТабличныйДокумент;
	ПечатьНаСервере(ТабДокс) ;
	ТабДокс.ОтображатьСетку = Ложь;
	ТабДокс.ОтображатьЗаголовки = Ложь;
	ТабДокс.Показать();
КонецПроцедуры

&НаСервере
Процедура ПечатьНаСервере(ТабДок)
	Справочники.Номенклатура.ПечатьНаСервереММ(ТабДок) ;
КонецПроцедуры

&НаКлиенте
Процедура Печать2 (Команда)
ТабДок = Новый ТабличныйДокумент;
	ПечатьНаСервере2(ТабДок);
	ТабДок.ОтображатьСетку = Ложь;
	ТабДок.ОтображатьЗаголовки = Ложь;
	ТабДок.Показать();	
	
КонецПроцедуры

&НаСервере
Процедура ПечатьНаСервере2(ТабДок)
	Справочники.Номенклатура.ПечатьНаСервереММ(ТабДок) ;
КонецПроцедуры

