
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	//Вставить содержимое обработчика.
	//ПараметрыФормы = Новый Структура("", );
	//ОткрытьФорму("Справочник.Номенклатура.ФормаСписка", ПараметрыФормы, ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно, ПараметрыВыполненияКоманды.НавигационнаяСсылка);
	ПолучитьТабличныйДокументОстаткиТоваров().Показать();
КонецПроцедуры

&НаСервере
Функция ПолучитьТабличныйДокументОстаткиТоваров()

Схема = Отчеты.Остатки.ПолучитьМакет("ОсновнаяСхемаКомпоновкиДанных");	
Настройки = Схема.НастройкиПоУмолчанию;

	Параметр = Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных ("Период"));
	Если Параметр <> Неопределено Тогда
	
		Параметр.Значение = ТекущаяДата();
		Параметр.Использование = Истина;
	КонецЕсли;

	
	
КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;

Макет = КомпоновщикМакета.Выполнить(Схема, Настройки);

ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
ПроцессорКомпоновки.Инициализировать(Макет);

ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
ТабДок = Новый ТабличныйДокумент;
ПроцессорВывода.УстановитьДокумент(ТабДок);
ПроцессорВывода.Вывести(ПроцессорКомпоновки);

Возврат ТабДок;

КонецФункции