
Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ТаблицаДанных = Новый ТаблицаЗначений;
	
	ВыгрузитьЖурналРегистрации(ТаблицаДанных);
	
	ВнешнийНабор = Новый Структура("ТаблицаДанных", ТаблицаДанных);
	
	ИсточникДанных = СхемаКомпоновкиДанных.ИсточникиДанных.Добавить();
	ИсточникДанных.Имя = "Источник данных 1";
	ИсточникДанных.ТипИсточникаДанных = "Local";
	
	НаборДанныхОбъект = СхемаКомпоновкиДанных.НаборыДанных.Добавить(Тип("НаборДанныхОбъектСхемыКомпоновкиДанных"));
	НаборДанныхОбъект.ИмяОбъекта = "ТаблицаДанных";
	НаборДанныхОбъект.Имя = "Набор данных 1";
	НаборДанныхОбъект.ИсточникДанных = "Источник данных 1";
	
	Поле = НаборДанныхОбъект.Поля.Добавить(Тип("ПолеНабораДанныхСхемыКомпоновкиДанных"));
	Поле.Поле = "Пользователь";
	Поле.ПутьКДанным = "Пользователь";
	
	Поле = НаборДанныхОбъект.Поля.Добавить(Тип("ПолеНабораДанныхСхемыКомпоновкиДанных"));
	Поле.Поле = "Дата";
	Поле.ПутьКДанным = "Дата";
	
	Поле = НаборДанныхОбъект.Поля.Добавить(Тип("ПолеНабораДанныхСхемыКомпоновкиДанных"));
	Поле.Поле = "Событие";
	Поле.ПутьКДанным = "Событие";
	
	Поле = НаборДанныхОбъект.Поля.Добавить(Тип("ПолеНабораДанныхСхемыКомпоновкиДанных"));
	Поле.Поле = "Метаданные";
	Поле.ПутьКДанным = "Метаданные";
	
	
	Настройки = КомпоновщикНастроек.Настройки;
	
	Если Настройки.Структура.Количество()=0 Тогда
		
	Группировка = Настройки.Структура.Добавить(Тип("ГруппировкаКомпоновкиДанных"));
	Группировка.Использование = Истина;
	ПолеГруппировки = Группировка.ПоляГруппировки.Элементы.Добавить(Тип("ПолеГруппировкиКомпоновкиДанных"));
	ПолеГруппировки.Использование = Истина;
	ПолеГруппировки.Поле = Новый ПолеКомпоновкиДанных("Пользователь");
	
	ДетальныеЗаписи = Группировка.Структура.Добавить(Тип("ГруппировкаКомпоновкиДанных"));
	ДетальныеЗаписи.Использование = Истина;
	АвтоПоле = ДетальныеЗаписи.Выбор.Элементы.Добавить(Тип("АвтоВыбранноеПолеКомпоновкиДанных"));
	АвтоПоле.Использование = Истина;
	
	АвтоПоле = Группировка.Выбор.Элементы.Добавить(Тип("АвтоВыбранноеПолеКомпоновкиДанных"));
	АвтоПоле.Использование = Истина;
		
	ПолеКомпоновки = Настройки.Выбор.Элементы.Добавить(Тип("ВыбранноеПолеКомпоновкиДанных"));
	ПолеКомпоновки.Использование = Истина;
	ПолеКомпоновки.Поле = Новый ПолеКомпоновкиДанных("Дата");
	
	ПолеКомпоновки = Настройки.Выбор.Элементы.Добавить(Тип("ВыбранноеПолеКомпоновкиДанных"));
	ПолеКомпоновки.Использование = Истина;
	ПолеКомпоновки.Поле = Новый ПолеКомпоновкиДанных("Событие");

	ПолеКомпоновки = Настройки.Выбор.Элементы.Добавить(Тип("ВыбранноеПолеКомпоновкиДанных"));
	ПолеКомпоновки.Использование = Истина;
	ПолеКомпоновки.Поле = Новый ПолеКомпоновкиДанных("Метаданные");

	
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, Настройки);
	
	ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновки.Инициализировать(МакетКомпоновки,ВнешнийНабор);
	
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПроцессорВывода.УстановитьДокумент(ДокументРезультат);
	ПроцессорВывода.Вывести(ПроцессорКомпоновки);
		
	КонецЕсли;
	
КонецПроцедуры
