
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	
	//Вставить содержимое обработчика.
	Отбор = Новый Структура("Номенклатура", ПараметрКоманды);
	
	ПараметрыФормы = Новый Структура("СформироватьПриОткрытии, Отбор, КлючВарианта", Истина, Отбор, "Вариант1");
	//ОткрытьФорму("Справочник.Номенклатура.ФормаСписка", ПараметрыФормы, ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно, ПараметрыВыполненияКоманды.НавигационнаяСсылка);
	ОткрытьФорму("Отчет.Продажи.Форма.ФормаОтчета", ПараметрыФормы, ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно, ПараметрыВыполненияКоманды.НавигационнаяСсылка);
КонецПроцедуры
